examples_3D_Simulations/3_3D_RM6_noPTO_fine/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(atmosphere|inlet|outlet|bottom)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    "(baffle.*)"
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    "(object.*)"
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }

    sides
    {
        patchType       overset;
        type            zeroGradient;
    }
}


// ************************************************************************* //
